package tasksMap;

/**
 * Необходимо разработать приложение, которое
 * позволит сохранять информацию о логинах пользователей
 * и их паролях. Каждому пользователю соответствует пара
 * логин — пароль. При старте приложение отображается меню:
 * 1. Добавить нового пользователя.
 * 2. Удалить существующего пользователя.
 * 3. Проверить существует ли пользователь.
 * 4. Изменить логин существующего пользователя.
 * 5. Изменить пароль существующего пользователя.
 * В зависимости от выбора пользователя выполняется
 * действие, после чего меню отображается снова. Для
 * решения задачи используйте подходящий класс из Java
 * Collections Framework.
 */
public class Main {
    public static void main(String[] args) {
        Menu menu = new Menu();
        menu.menuCycle();
    }
}
